app/controllers/api/v1/categories_controller.rb

  def index
    @categories = current_user.categories.all
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`user_id` = 2

  def create
    @category = current_user.categories.new(category_params)

    if @category.save
---
INSERT INTO `categories` (`title`, `created_at`, `updated_at`, `user_id`) VALUES ('fish', '2021-01-19 20:30:00.908424', '2021-01-19 20:30:00.908424', 2)

    def set_category
      @category = current_user.category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`user_id` = 2 AND `categories`.`id` = 3 LIMIT 1