app/controllers/api/v1/items_controller.rb

  def index
    @items = current_category.items.all
---
SELECT `items`.* FROM `items` WHERE `items`.`category_id` = 3