app/controllers/api/v1/sessions_controller.rb

    def create
      user_password = params[:session][:password]
      user_email = params[:session][:email]
      @user = User.find_by(email: user_email)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'hammada0@gmail.com' LIMIT 1