app/controllers/api/v1/types_controller.rb

  def index
    @types = current_user.types.all
---
SELECT `types`.* FROM `types` WHERE `types`.`user_id` = 2

  def create
    @type = current_user.types.new(type_params)

    if @type.save
---
INSERT INTO `types` (`title`, `created_at`, `updated_at`, `user_id`) VALUES ('fish hot', '2021-01-19 22:03:15.277518', '2021-01-19 22:03:15.277518', 2)