app/controllers/api/v1/users_controller.rb

    def create
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `auth_token`) VALUES ('hammada0@gmail.com', '$2a$12$0x6p2aZwk17BaswwYgi2R.hVvjWWgNHRfESrhB.H8eGITgxXKnBdK', '2021-01-09 21:32:56.637415', '2021-01-09 21:32:56.637415', 'FruEV-aoxHVsD_tphhq8')