app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`auth_token` = 'qcRV7YKJ4oJxsyW2sDZB' LIMIT 1
---
    def current_user
        @current_user ||= User.find_by(auth_token: request.headers['Authorization'])

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
---
      def current_category
        @current_category ||= Category.find(params[:id])

SELECT `types`.* FROM `types` WHERE `types`.`id` = NULL LIMIT 1
---
      def current_type
        @current_type ||= Type.find(params[:id])