app/models/user.rb

  def generate_authentication_token!
    begin
      self.auth_token = Devise.friendly_token
    end while self.class.exists?(auth_token: auth_token)
---
SELECT 1 AS one FROM `users` WHERE `users`.`auth_token` = 'yAs-oy_F8XBNc9wAenbL' LIMIT 1